
#Область ПрограммныйИнтерфейс

// Создать таблицу значений.
// 
// Параметры:
//  КоличествоЭлементов - Число - Количество элементов
// 
// Возвращаемое значение:
// См. СоздатьПустуюТаблицуЗначений
Функция СоздатьТаблицуЗначений(Знач КоличествоЭлементов) Экспорт
	ТЗ = СоздатьПустуюТаблицуЗначений();
	
	ЗаполнитьТаблицуЗначений(ТЗ, КоличествоЭлементов , 1);
	
	Возврат ТЗ;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполнить таблицу значений.
// 
// Параметры:
//  ТЗ - См. СоздатьПустуюТаблицуЗначений
//  КоличествоЭлементов - Число - Количество элементов
//  НачальныйID - Число - Начальный ID
Процедура ЗаполнитьТаблицуЗначений(ТЗ,Знач КоличествоЭлементов,Знач НачальныйID) Экспорт
	Для Сч = 1 По КоличествоЭлементов Цикл
		Стр = ТЗ.Добавить();
		Стр.ID = Сч + НачальныйID - 1;
		Стр.Q  = 1;		
		Стр.T  = "MGT";
		Стр.S  = 0;							
	КонецЦикла; 	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создать пустую таблицу значений.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Создать пустую таблицу значений:
// * ID - Число - Идентификатор
// * Q  - Число - Количетсво
// * T  - Строка - Тип
// * S - Число - Сумма
Функция СоздатьПустуюТаблицуЗначений() Экспорт
	
	ОписаниеЧисла  = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 0));
	ОписаниеСтрока = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10));
	
	ТЗ = Новый ТаблицаЗначений();
	ТЗ.Колонки.Добавить("ID",ОписаниеЧисла);
	ТЗ.Колонки.Добавить("Q",ОписаниеЧисла);
	ТЗ.Колонки.Добавить("T",ОписаниеСтрока);
	ТЗ.Колонки.Добавить("S",ОписаниеЧисла);
	
	Возврат ТЗ;

КонецФункции

#КонецОбласти
