
#Область ОбработчикиСобытийФормы

// При создании на сервере.
// 
// Параметры:
//  Отказ - Булево - Отказ
//  СтандартнаяОбработка - Булево - Стандартная обработка
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.РазмерТаблицыИсходныхДанныхДляРасчета = 2400000;
	
	// Резервируем адрес временного хранилища
	АдресДанныхЗамера = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор); 
	
КонецПроцедуры

// Проверить выполнение теста.
&НаКлиенте
Процедура ПроверитьВыполнениеТеста() Экспорт
	Если ПроверитьВыполнениеЗаданиеНаСервере() Тогда
		ОтключитьОбработчикОжидания("ПроверитьВыполнениеТеста");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Запустить.
// 
// Параметры:
//  Команда - КомандаФормы - Команда
&НаКлиенте
Процедура Запустить(Команда)
	
	Элементы.ГруппаПанельТеста.Видимость = Ложь;
	Элементы.ГруппаОжидатьЗавершенияФЗ.Видимость = Истина;
	Элементы.ФормаЗапустить.Доступность = Ложь;
	
	ОтображениеСостояния = Элементы.ТабДок.ОтображениеСостояния;
 	ОтображениеСостояния.Видимость = Истина;
 	ОтображениеСостояния.Картинка = БиблиотекаКартинок.ДлительнаяОперация48;
 	ОтображениеСостояния.Текст = НСтр("ru = 'Ожидание завершения работы фоновых заданий. Ждите....'");	
		
	Если ЗапуститьЗаданиеНаСервере() Тогда	
		ПодключитьОбработчикОжидания("ПроверитьВыполнениеТеста", 15, Ложь );
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Запустить задание на сервере.
// 
// Возвращаемое значение:
//  Булево - Запустить задание на сервере
&НаСервере
Функция ЗапуститьЗаданиеНаСервере()
	ПараметрыЗадания = Новый Массив(2);
	ПараметрыЗадания[0] = Объект.РазмерТаблицыИсходныхДанныхДляРасчета;
	ПараметрыЗадания[1] = АдресДанныхЗамера;
	
	Задание = ФоновыеЗадания.Выполнить("ТестПроцессораКластера1С.ВыполнитьТест",
				ПараметрыЗадания,
				Строка(Новый УникальныйИдентификатор()),
				"ТестПроцессораКластера1С.ВыполнитьТест"
			  );
		
	Задание = Задание.ОжидатьЗавершенияВыполнения(2);
		
	Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		
		КлючЗадания = Задание.УникальныйИдентификатор;
				
		Возврат Истина;
	КонецЕсли;
	
	ОтобразитьДиаграммыПроизводительности();
				
	Возврат Ложь;			
				
КонецФункции

// Проверить выполнение задание на сервере.
// 
// Возвращаемое значение:
//  Булево - Проверить выполнение задание на сервере
&НаСервере
Функция ПроверитьВыполнениеЗаданиеНаСервере()
		
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(КлючЗадания);

	Задание = Задание.ОжидатьЗавершенияВыполнения(1);		
				
	Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда			
		Возврат Ложь;
	КонецЕсли;
	
	ОтобразитьДиаграммыПроизводительности();
	
	Возврат Истина;
	
КонецФункции

// Отобразить диаграммы производительности.
&НаСервере
Процедура ОтобразитьДиаграммыПроизводительности()
	
	ДанныеЗамера = ПолучитьИзВременногоХранилища(АдресДанныхЗамера);
	
	ДиаграммаПроизводительностиЯдра.Точки.Очистить();
	ДиаграммаПроизводительностиЯдра.Серии.Очистить();
	
	Диаграмма.Точки.Очистить();
	Диаграмма.Серии.Очистить();
	
	ВремяВыполнения = Диаграмма.Серии.Добавить("Время выполнения, мс");
	
	Инфо = Новый СистемнаяИнформация();
		
	Процессор     = ДиаграммаПроизводительностиЯдра.Точки.Добавить(Инфо.Процессор);
	ОперацийВСекунду = ДиаграммаПроизводительностиЯдра.Серии.Добавить("Операций в секунду");
	
	Для Каждого Стр Из ДанныеЗамера Цикл
		Точка = Диаграмма.Точки.Добавить(Стр.Наименование);
	
		Диаграмма.УстановитьЗначение(Точка,ВремяВыполнения, Стр.Длительность , "", "" );
		
		Если Стр.Наименование = "1" Тогда
			Производительность = Окр( (Стр.КоличествоЭлементов*2) / (Стр.Длительность/1000)); 
			ДиаграммаПроизводительностиЯдра.УстановитьЗначение(Процессор,ОперацийВСекунду ,Производительность);
		КонецЕсли;
		
	КонецЦикла;		

	Элементы.ГруппаОжидатьЗавершенияФЗ.Видимость = Ложь;
	Элементы.ГруппаПанельТеста.Видимость = Истина;
	Элементы.ФормаЗапустить.Доступность = Истина;	
	Элементы.ТабДок.ОтображениеСостояния.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти
