
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.РазмерТаблицыИсходныхДанныхДляРасчета = 24000000;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Запустить(Команда)
	ЗапуститьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗапуститьНаСервере()
	
	Диаграмма.Точки.Очистить();
	Диаграмма.Серии.Очистить();
	
	Диаграмма.Серии.Добавить("ВремяВыполнения");

	Т1 = ТекущаяУниверсальнаяДатаВМиллисекундах();

	ТЗ = ГенераторТаблицыЗначений.СоздатьТаблицуЗначений(Объект.РазмерТаблицыИсходныхДанныхДляРасчета);

	Т2 = ТекущаяУниверсальнаяДатаВМиллисекундах() - Т1;

	Сообщить(Т2);
	Сообщить("Итоговое количество элементов: "+XMLСтрока(ТЗ.Количество()));			
	
	Диаграмма.Точки.Добавить("Один поток").Значение = Т2;		
			
	ИмяФЗ = "СоздатьТаблицуЗначений";		
						
	Т1 = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
	ПараметрыФЗ = Новый Массив(1);	
	ПараметрыФЗ[0] = Объект.РазмерТаблицыИсходныхДанныхДляРасчета / 4;		
	ФоновыеЗадания.Выполнить("ГенераторТаблицыЗначений.СоздатьТаблицуЗначений",ПараметрыФЗ,ИмяФЗ+"_1");
	ФоновыеЗадания.Выполнить("ГенераторТаблицыЗначений.СоздатьТаблицуЗначений",ПараметрыФЗ,ИмяФЗ+"_2");
	ФоновыеЗадания.Выполнить("ГенераторТаблицыЗначений.СоздатьТаблицуЗначений",ПараметрыФЗ,ИмяФЗ+"_3");
	ФоновыеЗадания.Выполнить("ГенераторТаблицыЗначений.СоздатьТаблицуЗначений",ПараметрыФЗ,ИмяФЗ+"_4");

	ФоновыеЗаданияСервер.ОжидатьЗавершенияФоновыхЗадач(ИмяФЗ);

	Т2 = ТекущаяУниверсальнаяДатаВМиллисекундах() - Т1;

	Сообщить(Т2);
	Диаграмма.Точки.Добавить("Четыре потока").Значение = Т2;		

	Т1 = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
	ПараметрыФЗ = Новый Массив(1);	
	ПараметрыФЗ[0] = Объект.РазмерТаблицыИсходныхДанныхДляРасчета / 8;		
	ФоновыеЗадания.Выполнить("ГенераторТаблицыЗначений.СоздатьТаблицуЗначений",ПараметрыФЗ,ИмяФЗ+"_1");
	ФоновыеЗадания.Выполнить("ГенераторТаблицыЗначений.СоздатьТаблицуЗначений",ПараметрыФЗ,ИмяФЗ+"_2");
	ФоновыеЗадания.Выполнить("ГенераторТаблицыЗначений.СоздатьТаблицуЗначений",ПараметрыФЗ,ИмяФЗ+"_3");
	ФоновыеЗадания.Выполнить("ГенераторТаблицыЗначений.СоздатьТаблицуЗначений",ПараметрыФЗ,ИмяФЗ+"_4");
	ФоновыеЗадания.Выполнить("ГенераторТаблицыЗначений.СоздатьТаблицуЗначений",ПараметрыФЗ,ИмяФЗ+"_5");
	ФоновыеЗадания.Выполнить("ГенераторТаблицыЗначений.СоздатьТаблицуЗначений",ПараметрыФЗ,ИмяФЗ+"_6");
	ФоновыеЗадания.Выполнить("ГенераторТаблицыЗначений.СоздатьТаблицуЗначений",ПараметрыФЗ,ИмяФЗ+"_7");
	ФоновыеЗадания.Выполнить("ГенераторТаблицыЗначений.СоздатьТаблицуЗначений",ПараметрыФЗ,ИмяФЗ+"_8");

	ФоновыеЗаданияСервер.ОжидатьЗавершенияФоновыхЗадач(ИмяФЗ);

	Т2 = ТекущаяУниверсальнаяДатаВМиллисекундах() - Т1;
	Сообщить(Т2);
	Диаграмма.Точки.Добавить("Восемь потоков").Значение = Т2;		
		
				
	
КонецПроцедуры

#КонецОбласти
