
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.РазмерТаблицыИсходныхДанныхДляРасчета = 24000000;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Запустить(Команда)
	ЗапуститьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗапуститьНаСервере()
	
	Диаграмма.Точки.Очистить();
	Диаграмма.Серии.Очистить();
	
	Диаграмма.Серии.Добавить("ВремяВыполнения");

	Т1 = ТекущаяУниверсальнаяДатаВМиллисекундах();

	ТЗ = ГенераторТаблицыЗначений.СоздатьТаблицуЗначений(Объект.РазмерТаблицыИсходныхДанныхДляРасчета);

	Т2 = ТекущаяУниверсальнаяДатаВМиллисекундах() - Т1;

	Сообщить("Итоговое количество элементов: "+XMLСтрока(ТЗ.Количество()));			
	
	Диаграмма.Точки.Добавить("Один поток").Значение = Т2;		
				
	
КонецПроцедуры

#КонецОбласти
