#Область ПрограммныйИнтерфейс

// Ожидать завершения фоновых задач.
// 
// Параметры:
//  ИмяФЗ - Строка - Наименование фонового задания
Процедура ОжидатьЗавершенияФоновыхЗадач(Знач ИмяФЗ) Экспорт 
  
  МассивФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Состояние, Наименование",  СостояниеФоновогоЗадания.Активно , ИмяФЗ ));
  
  Если МассивФЗ.Количество() Тогда
	Попытка
    	ФоновыеЗадания.ОжидатьЗавершенияВыполнения(МассивФЗ);	
	Исключение                                                                                                                             
		Инфо = ИнформацияОбОшибке();
		
		ЗаписьЖурналаРегистрации("ОжидатьЗавершенияФоновыхЗадач",УровеньЖурналаРегистрации.Ошибка,
			,,ОбработкаОшибок.ПодробноеПредставлениеОшибки(Инфо));
	КонецПопытки;
	
	ОжидатьЗавершенияФоновыхЗадач(ИмяФЗ);
  КонецЕсли;
  
КонецПроцедуры

#КонецОбласти