
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записать.
// 
// Параметры:
//  ДанныеЗамера - см. ЗамерВремени.ИнициализироватьДанныеЗамера 
//  ИмяТеста - Строка - Имя теста
Процедура Записать(ДанныеЗамера, Знач ИмяТеста) Экспорт
	
	Инфо  	= Новый СистемнаяИнформация();
	ИдТеста = Новый УникальныйИдентификатор();
	
	Набор = СоздатьНаборЗаписей();
	
	Для Каждого Замер Из ДанныеЗамера Цикл
		
		Запись 		   = Набор.Добавить();
		Запись.ИдТеста = ИдТеста;
		Запись.Тест	   = Замер.Наименование;
		Запись.Дата	   = Замер.Дата;
		Запись.КоличествоИтераций = Замер.КоличествоИтераций;
		Запись.Длительность = Замер.Длительность;
		Запись.КоличествоПотоков = Замер.КоличествоПотоков;
		Запись.ИмяТеста = ИмяТеста;
		Запись.ИмяКомпьютера = ИмяКомпьютера();			
		Запись.Процессор = Инфо.Процессор;			
	КонецЦикла;
	
	Набор.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
